app/Controllers/ClientController.php

INSERT INTO `transactions` (`id_compte_source`, `id_compte_destination`, `id_type_operation`, `montant`, `date_transaction`, `frais`, `created_at`, `updated_at`) VALUES (NULL, 1, 1, 500000, '2026-07-20 12:56:16', 1500, '2026-07-20 12:56:16', '2026-07-20 12:56:16')
---
    public function deposer()
    {
        $montant = (float) $this->request->getPost('montant');

        if ($montant <= 0) {
            return $this->jsonError('Montant de dépôt invalide.');
        }

        $compte = $this->compteActuel();
        if (!$compte) {
            return $this->jsonError('Compte introuvable.', 404);
        }

        try {
            $idTypeDepot = $this->getTypeOperationId(self::LIBELLE_DEPOT);
            $frais = $this->calculerFrais($idTypeDepot, $montant);
        } catch (RuntimeException $e) {
            return $this->jsonError($e->getMessage());
        }

        $db = \Config\Database::connect();
        $db->transStart();

        $this->compteModel->crediter($compte['id'], $montant);

        $this->transactionsModel->insert([
            'id_compte_source' => null,
            'id_compte_destination' => $compte['id'],
            'id_type_operation' => $idTypeDepot,
            'montant' => $montant,
            'date_transaction' => date('Y-m-d H:i:s'),
            'frais' => $frais,
        ]);