app/Controllers/OperateurController.php

SELECT `id`, `libelle`
FROM `types_operations`
---
    public function editFromBareme($id)
    {
        $baremeModel = new BaremeModel();
        $bareme = $baremeModel->getBaremeById($id);

        if (!$bareme) {
            return redirect()->to('/operateur/bareme')->with('error', 'Barème introuvable.');
        }

        $typesOperationsModel = new TypeOperationModel();
        $typesOperations = $typesOperationsModel->select('id, libelle')->findAll();