app/Models/BaremeModel.php

SELECT *
FROM `baremes`
WHERE `baremes`.`id` = '2'
---
    public function getBaremeById($id)
    {
        return $this->find($id);

UPDATE `baremes` SET `id_type_operation` = '1', `montant_min` = '5001', `montant_max` = '10000', `frais` = '100'
WHERE `baremes`.`id` IN ('3')
---
    public function updateBareme($id, $data)
    {
        return $this->update($id, $data);

SELECT `baremes`.*, `types_operations`.`libelle` as `type_libelle`
FROM `baremes`
LEFT JOIN `types_operations` ON `types_operations`.`id` = `baremes`.`id_type_operation`
ORDER BY `baremes`.`id_type_operation` ASC, `baremes`.`montant_min` ASC
SELECT COUNT(*) AS `numrows`
FROM `baremes`
LEFT JOIN `types_operations` ON `types_operations`.`id` = `baremes`.`id_type_operation`
SELECT `baremes`.*, `types_operations`.`libelle` as `type_libelle`
FROM `baremes`
LEFT JOIN `types_operations` ON `types_operations`.`id` = `baremes`.`id_type_operation`
ORDER BY `baremes`.`id_type_operation` ASC, `baremes`.`montant_min` ASC
 LIMIT 10
---
    public function getAllBaremesWithOperations($perPage = null)
    {
        $builder = $this->select('baremes.*, types_operations.libelle as type_libelle')
            ->join('types_operations', 'types_operations.id = baremes.id_type_operation', 'left')
            ->orderBy('baremes.id_type_operation', 'ASC')
            ->orderBy('baremes.montant_min', 'ASC');

        return $perPage === null
            ? $builder->findAll()
            : $builder->paginate($perPage);

SELECT *
FROM `baremes`
WHERE `id_type_operation` = 1
AND `montant_min` <= 500000
AND `montant_max` >= 500000
 LIMIT 1
---
    public function getBaremeForMontant($id_type_operation, $montant)
    {
        return $this->where('id_type_operation', $id_type_operation)
            ->where('montant_min <=', $montant)
            ->where('montant_max >=', $montant)
            ->first();