app/Models/ClientModel.php

    public function getClientByTelephone($telephone)
    {
        return $this->select('clients.*, comptes.id as id_compte, comptes.solde')
            ->join('comptes', 'clients.id = comptes.id_client', 'left')
            ->where('telephone', $telephone)
            ->first();
---
SELECT `clients`.*, `comptes`.`id` as `id_compte`, `comptes`.`solde`
FROM `clients`
LEFT JOIN `comptes` ON `clients`.`id` = `comptes`.`id_client`
WHERE `telephone` = '0337654321'
 LIMIT 1

    public function getClientsByTelephone($telephone)
    {
        return $this->where('telephone', $telephone)->first();
---
SELECT *
FROM `clients`
WHERE `telephone` = '0337654321'
 LIMIT 1

    public function getPrefixeByNumber(string $telephone)
    {
        $codePrefixe = substr($telephone, 0, 3); // Extrait 033, 037, etc.

        return $this->db->table('prefixes')
            ->where('prefixe', $codePrefixe)
            ->get()
            ->getRowArray();
---
SELECT *
FROM `prefixes`
WHERE `prefixe` = '033'

    public function getCountClients()
    {
        return $this->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `clients`