app/Models/CompteModel.php

SELECT *
FROM `comptes`
WHERE `id_client` = 3
 LIMIT 1
---
    public function getCompteByClientId($id_client)
    {
        return $this->where('id_client', $id_client)->first();

SELECT *
FROM `comptes`
WHERE `comptes`.`id` = 3
UPDATE `comptes` SET `solde` = 1000000, `updated_at` = '2026-07-20 12:56:16'
WHERE `comptes`.`id` IN (1)
---
    public function crediter($id_compte, $montant)
    {
        $compte = $this->find($id_compte);
        if ($compte) {
            $nouveau_solde = $compte['solde'] + $montant;
            return $this->update($id_compte, ['solde' => $nouveau_solde]);

SELECT *
FROM `comptes`
WHERE `comptes`.`id` = 3
UPDATE `comptes` SET `solde` = 794950, `updated_at` = '2026-07-20 12:57:04'
WHERE `comptes`.`id` IN (3)
---
    public function debiter($id_compte, $montant)
    {
        $compte = $this->find($id_compte);
        if ($compte && $compte['solde'] >= $montant) {
            $nouveau_solde = $compte['solde'] - $montant;
            return $this->update($id_compte, ['solde' => $nouveau_solde]);

SELECT *
FROM `comptes`
WHERE `comptes`.`id` = 3
---
    public function getSolde($id_compte)
    {
        $compte = $this->find($id_compte);