app/Models/PrefixeModel.php

SELECT *
FROM `prefixes`
WHERE `prefixes`.`id` = '2'
---
    public function getPrefixById($id)
    {
        return $this->find($id);

INSERT INTO `prefixes` (`prefixe`, `actif`) VALUES ('035', '1')
---
    public function addPrefix(array $data)
    {
        // insert() retourne l'ID inséré, ou false si la validation échoue
        return $this->insert($data);