app/Models/TransactionsModel.php

SELECT `transactions`.*, `types_operations`.`libelle` as `type_operation`
FROM `transactions`
JOIN `types_operations` ON `types_operations`.`id` = `transactions`.`id_type_operation`
WHERE `id_compte_source` = 3
OR `id_compte_destination` = 3
ORDER BY `date_transaction` DESC
---
    public function getTransactionsByCompte($id_compte)
    {
        return $this->select('transactions.*, types_operations.libelle as type_operation')
            ->join('types_operations', 'types_operations.id = transactions.id_type_operation')
            ->where('id_compte_source', $id_compte)
            ->orWhere('id_compte_destination', $id_compte)
            ->orderBy('date_transaction', 'DESC')
            ->findAll();

SELECT SUM(`frais`) AS `frais`
FROM `transactions`
WHERE `id_type_operation` = 3
 LIMIT 1
---
    public function getGainByTransfert()
    {
        return $this->selectSum('frais')->where('id_type_operation', 3)->first();

SELECT SUM(`frais`) AS `frais`
FROM `transactions`
WHERE `id_type_operation` = 2
 LIMIT 1
---
    public function getGainByRetrait()
    {
        return $this->selectSum('frais')->where('id_type_operation', 2)->first();

SELECT SUM(`transactions`.`frais`) AS `frais`
FROM `transactions`
LEFT JOIN `comptes` as `compte_destination` ON `compte_destination`.`id` = `transactions`.`id_compte_destination`
LEFT JOIN `clients` as `client_destination` ON `client_destination`.`id` = `compte_destination`.`id_client`
LEFT JOIN `prefixes` ON `prefixes`.`id` = `client_destination`.`id_prefixe`
WHERE `transactions`.`id_type_operation` = 3
AND `prefixes`.`est_autre_operateur` = 0
 LIMIT 1
---
    public function getGainByTransfertForOperatorType(int $isOtherOperator): array
    {
        return $this->selectSum('transactions.frais', 'frais')
            ->join('comptes as compte_destination', 'compte_destination.id = transactions.id_compte_destination', 'left')
            ->join('clients as client_destination', 'client_destination.id = compte_destination.id_client', 'left')
            ->join('prefixes', 'prefixes.id = client_destination.id_prefixe', 'left')
            ->where('transactions.id_type_operation', 3)
            ->where('prefixes.est_autre_operateur', $isOtherOperator)
            ->first();

SELECT `prefixes`.`prefixe`, `prefixes`.`est_autre_operateur`, COALESCE(SUM(transactions.frais), 0) as total_frais, COALESCE(SUM(transactions.montant), 0) as total_montant
FROM `transactions`
LEFT JOIN `comptes` as `compte_destination` ON `compte_destination`.`id` = `transactions`.`id_compte_destination`
LEFT JOIN `clients` as `client_destination` ON `client_destination`.`id` = `compte_destination`.`id_client`
LEFT JOIN `prefixes` ON `prefixes`.`id` = `client_destination`.`id_prefixe`
WHERE `transactions`.`id_type_operation` = 3
GROUP BY `prefixes`.`id`, `prefixes`.`prefixe`, `prefixes`.`est_autre_operateur`
ORDER BY `prefixes`.`prefixe` ASC
---
    public function getTransferGainBreakdown(): array
    {
        return $this->select('prefixes.prefixe, prefixes.est_autre_operateur, COALESCE(SUM(transactions.frais), 0) as total_frais, COALESCE(SUM(transactions.montant), 0) as total_montant')
            ->join('comptes as compte_destination', 'compte_destination.id = transactions.id_compte_destination', 'left')
            ->join('clients as client_destination', 'client_destination.id = compte_destination.id_client', 'left')
            ->join('prefixes', 'prefixes.id = client_destination.id_prefixe', 'left')
            ->where('transactions.id_type_operation', 3)
            ->groupBy('prefixes.id, prefixes.prefixe, prefixes.est_autre_operateur')
            ->orderBy('prefixes.prefixe', 'ASC')
            ->findAll();